openfoam_cases/design_A_low_blockage/system/meshQualityDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

#includeEtc "caseDicts/mesh/generation/meshQualityDict"
minFaceWeight 0.02;
