openfoam_cases/design_A_low_blockage/system/sampleDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}

targetPlaneSamples
{
    type                sets;
    libs                ("libsampling.so");
    setFormat           raw;
    interpolationScheme cellPoint;
    fields              (U p);

    sets
    {
        plane_x_100mm
        {
            type        points;
            ordered     no;
            axis        xyz;
            points
            (
                (0.100 -0.098 -0.098)
                (0.100 -0.098 -0.094)
                (0.100 -0.098 -0.090)
                (0.100 -0.098 -0.086)
                (0.100 -0.098 -0.082)
                (0.100 -0.098 -0.078)
                (0.100 -0.098 -0.074)
                (0.100 -0.098 -0.070)
                (0.100 -0.098 -0.066)
                (0.100 -0.098 -0.062)
                (0.100 -0.098 -0.058)
                (0.100 -0.098 -0.054)
                (0.100 -0.098 -0.050)
                (0.100 -0.098 -0.046)
                (0.100 -0.098 -0.042)
                (0.100 -0.098 -0.038)
                (0.100 -0.098 -0.034)
                (0.100 -0.098 -0.030)
                (0.100 -0.098 -0.026)
                (0.100 -0.098 -0.022)
                (0.100 -0.098 -0.018)
                (0.100 -0.098 -0.014)
                (0.100 -0.098 -0.010)
                (0.100 -0.098 -0.006)
                (0.100 -0.098 -0.002)
                (0.100 -0.098 0.002)
                (0.100 -0.098 0.006)
                (0.100 -0.098 0.010)
                (0.100 -0.098 0.014)
                (0.100 -0.098 0.018)
                (0.100 -0.098 0.022)
                (0.100 -0.098 0.026)
                (0.100 -0.098 0.030)
                (0.100 -0.098 0.034)
                (0.100 -0.098 0.038)
                (0.100 -0.098 0.042)
                (0.100 -0.098 0.046)
                (0.100 -0.098 0.050)
                (0.100 -0.098 0.054)
                (0.100 -0.098 0.058)
                (0.100 -0.098 0.062)
                (0.100 -0.098 0.066)
                (0.100 -0.098 0.070)
                (0.100 -0.098 0.074)
                (0.100 -0.098 0.078)
                (0.100 -0.098 0.082)
                (0.100 -0.098 0.086)
                (0.100 -0.098 0.090)
                (0.100 -0.098 0.094)
                (0.100 -0.098 0.098)
                (0.100 -0.094 -0.098)
                (0.100 -0.094 -0.094)
                (0.100 -0.094 -0.090)
                (0.100 -0.094 -0.086)
                (0.100 -0.094 -0.082)
                (0.100 -0.094 -0.078)
                (0.100 -0.094 -0.074)
                (0.100 -0.094 -0.070)
                (0.100 -0.094 -0.066)
                (0.100 -0.094 -0.062)
                (0.100 -0.094 -0.058)
                (0.100 -0.094 -0.054)
                (0.100 -0.094 -0.050)
                (0.100 -0.094 -0.046)
                (0.100 -0.094 -0.042)
                (0.100 -0.094 -0.038)
                (0.100 -0.094 -0.034)
                (0.100 -0.094 -0.030)
                (0.100 -0.094 -0.026)
                (0.100 -0.094 -0.022)
                (0.100 -0.094 -0.018)
                (0.100 -0.094 -0.014)
                (0.100 -0.094 -0.010)
                (0.100 -0.094 -0.006)
                (0.100 -0.094 -0.002)
                (0.100 -0.094 0.002)
                (0.100 -0.094 0.006)
                (0.100 -0.094 0.010)
                (0.100 -0.094 0.014)
                (0.100 -0.094 0.018)
                (0.100 -0.094 0.022)
                (0.100 -0.094 0.026)
                (0.100 -0.094 0.030)
                (0.100 -0.094 0.034)
                (0.100 -0.094 0.038)
                (0.100 -0.094 0.042)
                (0.100 -0.094 0.046)
                (0.100 -0.094 0.050)
                (0.100 -0.094 0.054)
                (0.100 -0.094 0.058)
                (0.100 -0.094 0.062)
                (0.100 -0.094 0.066)
                (0.100 -0.094 0.070)
                (0.100 -0.094 0.074)
                (0.100 -0.094 0.078)
                (0.100 -0.094 0.082)
                (0.100 -0.094 0.086)
                (0.100 -0.094 0.090)
                (0.100 -0.094 0.094)
...
            );
        }
        plane_x_130mm
        {
            type        points;
            ordered     no;
            axis        xyz;
            points
            (
                (0.130 -0.098 -0.098)
                (0.130 -0.098 -0.094)
                (0.130 -0.098 -0.090)
                (0.130 -0.098 -0.086)
                (0.130 -0.098 -0.082)
                (0.130 -0.098 -0.078)
                (0.130 -0.098 -0.074)
                (0.130 -0.098 -0.070)
                (0.130 -0.098 -0.066)
                (0.130 -0.098 -0.062)
                (0.130 -0.098 -0.058)
                (0.130 -0.098 -0.054)
                (0.130 -0.098 -0.050)
                (0.130 -0.098 -0.046)
                (0.130 -0.098 -0.042)
                (0.130 -0.098 -0.038)
                (0.130 -0.098 -0.034)
                (0.130 -0.098 -0.030)
                (0.130 -0.098 -0.026)
                (0.130 -0.098 -0.022)
                (0.130 -0.098 -0.018)
                (0.130 -0.098 -0.014)
                (0.130 -0.098 -0.010)
                (0.130 -0.098 -0.006)
                (0.130 -0.098 -0.002)
                (0.130 -0.098 0.002)
                (0.130 -0.098 0.006)
                (0.130 -0.098 0.010)
                (0.130 -0.098 0.014)
                (0.130 -0.098 0.018)
                (0.130 -0.098 0.022)
                (0.130 -0.098 0.026)
                (0.130 -0.098 0.030)
                (0.130 -0.098 0.034)
                (0.130 -0.098 0.038)
                (0.130 -0.098 0.042)
                (0.130 -0.098 0.046)
                (0.130 -0.098 0.050)
                (0.130 -0.098 0.054)
                (0.130 -0.098 0.058)
                (0.130 -0.098 0.062)
                (0.130 -0.098 0.066)
                (0.130 -0.098 0.070)
                (0.130 -0.098 0.074)
                (0.130 -0.098 0.078)
                (0.130 -0.098 0.082)
                (0.130 -0.098 0.086)
                (0.130 -0.098 0.090)
                (0.130 -0.098 0.094)
                (0.130 -0.098 0.098)
                (0.130 -0.094 -0.098)
                (0.130 -0.094 -0.094)
                (0.130 -0.094 -0.090)
                (0.130 -0.094 -0.086)
                (0.130 -0.094 -0.082)
                (0.130 -0.094 -0.078)
                (0.130 -0.094 -0.074)
                (0.130 -0.094 -0.070)
                (0.130 -0.094 -0.066)
                (0.130 -0.094 -0.062)
                (0.130 -0.094 -0.058)
                (0.130 -0.094 -0.054)
                (0.130 -0.094 -0.050)
                (0.130 -0.094 -0.046)
                (0.130 -0.094 -0.042)
                (0.130 -0.094 -0.038)
                (0.130 -0.094 -0.034)
                (0.130 -0.094 -0.030)
                (0.130 -0.094 -0.026)
                (0.130 -0.094 -0.022)
                (0.130 -0.094 -0.018)
                (0.130 -0.094 -0.014)
                (0.130 -0.094 -0.010)
                (0.130 -0.094 -0.006)
                (0.130 -0.094 -0.002)
                (0.130 -0.094 0.002)
                (0.130 -0.094 0.006)
                (0.130 -0.094 0.010)
                (0.130 -0.094 0.014)
                (0.130 -0.094 0.018)
                (0.130 -0.094 0.022)
                (0.130 -0.094 0.026)
                (0.130 -0.094 0.030)
                (0.130 -0.094 0.034)
                (0.130 -0.094 0.038)
                (0.130 -0.094 0.042)
                (0.130 -0.094 0.046)
                (0.130 -0.094 0.050)
                (0.130 -0.094 0.054)
                (0.130 -0.094 0.058)
                (0.130 -0.094 0.062)
                (0.130 -0.094 0.066)
                (0.130 -0.094 0.070)
                (0.130 -0.094 0.074)
                (0.130 -0.094 0.078)
                (0.130 -0.094 0.082)
                (0.130 -0.094 0.086)
                (0.130 -0.094 0.090)
                (0.130 -0.094 0.094)
...
            );
        }
        plane_x_350mm
        {
            type        points;
            ordered     no;
            axis        xyz;
            points
            (
                (0.350 -0.098 -0.098)
                (0.350 -0.098 -0.094)
                (0.350 -0.098 -0.090)
                (0.350 -0.098 -0.086)
                (0.350 -0.098 -0.082)
                (0.350 -0.098 -0.078)
                (0.350 -0.098 -0.074)
                (0.350 -0.098 -0.070)
                (0.350 -0.098 -0.066)
                (0.350 -0.098 -0.062)
                (0.350 -0.098 -0.058)
                (0.350 -0.098 -0.054)
                (0.350 -0.098 -0.050)
                (0.350 -0.098 -0.046)
                (0.350 -0.098 -0.042)
                (0.350 -0.098 -0.038)
                (0.350 -0.098 -0.034)
                (0.350 -0.098 -0.030)
                (0.350 -0.098 -0.026)
                (0.350 -0.098 -0.022)
                (0.350 -0.098 -0.018)
                (0.350 -0.098 -0.014)
                (0.350 -0.098 -0.010)
                (0.350 -0.098 -0.006)
                (0.350 -0.098 -0.002)
                (0.350 -0.098 0.002)
                (0.350 -0.098 0.006)
                (0.350 -0.098 0.010)
                (0.350 -0.098 0.014)
                (0.350 -0.098 0.018)
                (0.350 -0.098 0.022)
                (0.350 -0.098 0.026)
                (0.350 -0.098 0.030)
                (0.350 -0.098 0.034)
                (0.350 -0.098 0.038)
                (0.350 -0.098 0.042)
                (0.350 -0.098 0.046)
                (0.350 -0.098 0.050)
                (0.350 -0.098 0.054)
                (0.350 -0.098 0.058)
                (0.350 -0.098 0.062)
                (0.350 -0.098 0.066)
                (0.350 -0.098 0.070)
                (0.350 -0.098 0.074)
                (0.350 -0.098 0.078)
                (0.350 -0.098 0.082)
                (0.350 -0.098 0.086)
                (0.350 -0.098 0.090)
                (0.350 -0.098 0.094)
                (0.350 -0.098 0.098)
                (0.350 -0.094 -0.098)
                (0.350 -0.094 -0.094)
                (0.350 -0.094 -0.090)
                (0.350 -0.094 -0.086)
                (0.350 -0.094 -0.082)
                (0.350 -0.094 -0.078)
                (0.350 -0.094 -0.074)
                (0.350 -0.094 -0.070)
                (0.350 -0.094 -0.066)
                (0.350 -0.094 -0.062)
                (0.350 -0.094 -0.058)
                (0.350 -0.094 -0.054)
                (0.350 -0.094 -0.050)
                (0.350 -0.094 -0.046)
                (0.350 -0.094 -0.042)
                (0.350 -0.094 -0.038)
                (0.350 -0.094 -0.034)
                (0.350 -0.094 -0.030)
                (0.350 -0.094 -0.026)
                (0.350 -0.094 -0.022)
                (0.350 -0.094 -0.018)
                (0.350 -0.094 -0.014)
                (0.350 -0.094 -0.010)
                (0.350 -0.094 -0.006)
                (0.350 -0.094 -0.002)
                (0.350 -0.094 0.002)
                (0.350 -0.094 0.006)
                (0.350 -0.094 0.010)
                (0.350 -0.094 0.014)
                (0.350 -0.094 0.018)
                (0.350 -0.094 0.022)
                (0.350 -0.094 0.026)
                (0.350 -0.094 0.030)
                (0.350 -0.094 0.034)
                (0.350 -0.094 0.038)
                (0.350 -0.094 0.042)
                (0.350 -0.094 0.046)
                (0.350 -0.094 0.050)
                (0.350 -0.094 0.054)
                (0.350 -0.094 0.058)
                (0.350 -0.094 0.062)
                (0.350 -0.094 0.066)
                (0.350 -0.094 0.070)
                (0.350 -0.094 0.074)
                (0.350 -0.094 0.078)
                (0.350 -0.094 0.082)
                (0.350 -0.094 0.086)
                (0.350 -0.094 0.090)
                (0.350 -0.094 0.094)
...
            );
        }
    }
}
