openfoam_cases/design_A_low_blockage/system/snappyHexMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    obstruction
    {
        type triSurface;
        file "obstruction.stl";
    }

    guideRegion
    {
        type box;
        min (-0.002 -0.065 -0.065);
        max ( 0.030  0.065  0.065);
    }
}

castellatedMeshControls
{
    maxLocalCells       1200000;
    maxGlobalCells      1200000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features ();

    refinementSurfaces
    {
        obstruction
        {
            level (1 2);
            patchInfo
            {
                type wall;
                inGroups (solidSurfaces);
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        guideRegion
        {
            mode inside;
            level 1;
        }
    }

    insidePoint (0.2 0 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        5;
    tolerance           1.0;
    nSolveIter          100;
    nRelaxIter          10;
    nFeatureSnapIter    0;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers {};
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 100;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    #include "meshQualityDict"
}

writeFlags (scalarLevels);
mergeTolerance 1e-6;
